modm-ext/archive-stmicro-svd/rm_rm0008_stm32f101c4t6.svd
      <fields>
        <field>
          <name>EA</name>
          <bitOffset>0</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>STAT_TX</name>
          <bitOffset>4</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>DTOG_TX</name>
          <bitOffset>6</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CTR_TX</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EP_KIND</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EPTYPE</name>
          <bitOffset>9</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>SETUP</name>
          <bitOffset>11</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>STAT_RX</name>
          <bitOffset>12</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>DTOG_RX</name>
          <bitOffset>14</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CTR_RX</name>
          <bitOffset>15</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>EP6R</name>
        <addressOffset>0x18</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>EA</name>
          <bitOffset>0</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>STAT_TX</name>
          <bitOffset>4</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>DTOG_TX</name>
          <bitOffset>6</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CTR_TX</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EP_KIND</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EPTYPE</name>
          <bitOffset>9</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>SETUP</name>
          <bitOffset>11</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>STAT_RX</name>
          <bitOffset>12</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>DTOG_RX</name>
          <bitOffset>14</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CTR_RX</name>
          <bitOffset>15</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>EP7R</name>
        <addressOffset>0x1c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>EA</name>
          <bitOffset>0</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>STAT_TX</name>
          <bitOffset>4</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>DTOG_TX</name>
          <bitOffset>6</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CTR_TX</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EP_KIND</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EPTYPE</name>
          <bitOffset>9</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>SETUP</name>
          <bitOffset>11</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>STAT_RX</name>
          <bitOffset>12</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>DTOG_RX</name>
          <bitOffset>14</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CTR_RX</name>
          <bitOffset>15</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>CNTR</name>
        <addressOffset>0x40</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>FRES</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>PDWN</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>LPMODE</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>FSUSP</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RESUME</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ESOFM</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>SOFM</name>
          <bitOffset>9</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RESETM</name>
          <bitOffset>10</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>SUSPM</name>
          <bitOffset>11</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>WKUPM</name>
          <bitOffset>12</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ERRM</name>
          <bitOffset>13</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>PMAOVRM</name>
          <bitOffset>14</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CTRM</name>
          <bitOffset>15</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>ISTR</name>
        <addressOffset>0x44</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>EP_ID</name>
          <bitOffset>0</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>DIR</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ESOF</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>SOF</name>
          <bitOffset>9</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RESET</name>
          <bitOffset>10</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>SUSP</name>
          <bitOffset>11</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>WKUP</name>
          <bitOffset>12</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ERR</name>
          <bitOffset>13</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>PMAOVR</name>
          <bitOffset>14</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CTR</name>
          <bitOffset>15</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>FNR</name>
        <addressOffset>0x48</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>FN</name>
          <bitOffset>0</bitOffset>
          <bitWidth>11</bitWidth>
        </field>
        <field>
          <name>LSOF</name>
          <bitOffset>11</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>LCK</name>
          <bitOffset>13</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RXDM</name>
          <bitOffset>14</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RXDP</name>
          <bitOffset>15</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>DADDR</name>
        <addressOffset>0x4c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>ADD</name>
          <bitOffset>0</bitOffset>
          <bitWidth>7</bitWidth>
        </field>
        <field>
          <name>EF</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>BTABLE</name>
        <addressOffset>0x50</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BTABLE</name>
          <bitOffset>3</bitOffset>
          <bitWidth>13</bitWidth>
        </field>
      </fields>
    </peripheral>
    <peripheral>
      <name>CAN1</name>
      <baseAddress>0x40006400</baseAddress>
      <register>
        <name>MCR</name>
        <addressOffset>0x0</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>INRQ</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>SLEEP</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TXFP</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RFLM</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>NART</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>AWUM</name>
          <bitOffset>5</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ABOM</name>
          <bitOffset>6</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TTCM</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RESET</name>
          <bitOffset>15</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>DBF</name>
          <bitOffset>16</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>MSR</name>
        <addressOffset>0x4</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>INAK</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>SLAK</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ERRI</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>WKUI</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>SLAKI</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>s</name>
          <bitOffset>5</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>TXM</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RXM</name>
          <bitOffset>9</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>SAMP</name>
          <bitOffset>10</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RX</name>
          <bitOffset>11</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>TSR</name>
        <addressOffset>0x8</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>RQCP0</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TXOK0</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ALST0</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TERR0</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>s</name>
          <bitOffset>4</bitOffset>
          <bitWidth>19</bitWidth>
        </field>
        <field>
          <name>ABRQ0</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RQCP1</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TXOK1</name>
          <bitOffset>9</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ALST1</name>
          <bitOffset>10</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TERR1</name>
          <bitOffset>11</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ABRQ1</name>
          <bitOffset>15</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RQCP2</name>
          <bitOffset>16</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TXOK2</name>
          <bitOffset>17</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ALST2</name>
          <bitOffset>18</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TERR2</name>
          <bitOffset>19</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ABRQ2</name>
          <bitOffset>23</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CODE</name>
          <bitOffset>24</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>TME</name>
          <bitOffset>26</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>LOW</name>
          <bitOffset>29</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
      </fields>
      <register>
        <name>RF0R</name>
        <addressOffset>0xc</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>FMP0</name>
          <bitOffset>0</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>FULL0</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>FOVR0</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RFOM0</name>
          <bitOffset>5</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>RF1R</name>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>FMP1</name>
          <bitOffset>0</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>FULL1</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>FOVR1</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RFOM1</name>
          <bitOffset>5</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>IER</name>
        <addressOffset>0x14</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>TMEIE</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>FMPIE0</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>FFIE0</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>FOVIE0</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>FMPIE1</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>FFIE1</name>
          <bitOffset>5</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>FOVIE1</name>
          <bitOffset>6</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EWGIE</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EPVIE</name>
          <bitOffset>9</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>BOFIE</name>
          <bitOffset>10</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>LECIE</name>
          <bitOffset>11</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>s</name>
          <bitOffset>12</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>ERRIE</name>
          <bitOffset>15</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>WKUIE</name>
          <bitOffset>16</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>SLKIE</name>
          <bitOffset>17</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>ESR</name>
        <addressOffset>0x18</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>EWGF</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EPVF</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>BOFF</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>LEC</name>
          <bitOffset>4</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>TEC</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>REC</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BTR</name>
        <addressOffset>0x1c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BRP</name>
          <bitOffset>0</bitOffset>
          <bitWidth>10</bitWidth>
        </field>
        <field>
          <name>TS1</name>
          <bitOffset>16</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>TS2</name>
          <bitOffset>20</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>SJW</name>
          <bitOffset>24</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>LBKM</name>
          <bitOffset>30</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>SILM</name>
          <bitOffset>31</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>TI0R</name>
        <addressOffset>0x180</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>TXRQ</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RTR</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>IDE</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EXID</name>
          <bitOffset>3</bitOffset>
          <bitWidth>18</bitWidth>
        </field>
        <field>
          <name>STID/EXID</name>
          <bitOffset>21</bitOffset>
          <bitWidth>11</bitWidth>
        </field>
      </fields>
      <register>
        <name>TDT0R</name>
        <addressOffset>0x184</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>DLC</name>
          <bitOffset>0</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>TGT</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TIME</name>
          <bitOffset>16</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>TDL0R</name>
        <addressOffset>0x188</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>DATA0</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>DATA1</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>DATA2</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>DATA3</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>TDH0R</name>
        <addressOffset>0x18c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>DATA4</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>DATA5</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>DATA6</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>DATA7</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>TI1R</name>
        <addressOffset>0x190</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>TXRQ</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RTR</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>IDE</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EXID</name>
          <bitOffset>3</bitOffset>
          <bitWidth>18</bitWidth>
        </field>
        <field>
          <name>STID/EXID</name>
          <bitOffset>21</bitOffset>
          <bitWidth>11</bitWidth>
        </field>
      </fields>
      <register>
        <name>TDT1R</name>
        <addressOffset>0x194</addressOffset>
        <size>0x20</size>
      </register>
