modm-ext/archive-stmicro-svd/rm_rm0008_stm32f101c4t6.svd
      <fields>
        <field>
          <name>BRP</name>
          <bitOffset>0</bitOffset>
          <bitWidth>10</bitWidth>
        </field>
        <field>
          <name>TS1</name>
          <bitOffset>16</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>TS2</name>
          <bitOffset>20</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>SJW</name>
          <bitOffset>24</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>LBKM</name>
          <bitOffset>30</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>SILM</name>
          <bitOffset>31</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>TI0R</name>
        <addressOffset>0x180</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>TXRQ</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RTR</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>IDE</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EXID</name>
          <bitOffset>3</bitOffset>
          <bitWidth>18</bitWidth>
        </field>
        <field>
          <name>STID/EXID</name>
          <bitOffset>21</bitOffset>
          <bitWidth>11</bitWidth>
        </field>
      </fields>
      <register>
        <name>TDT0R</name>
        <addressOffset>0x184</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>DLC</name>
          <bitOffset>0</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>TGT</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TIME</name>
          <bitOffset>16</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>TDL0R</name>
        <addressOffset>0x188</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>DATA0</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>DATA1</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>DATA2</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>DATA3</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>TDH0R</name>
        <addressOffset>0x18c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>DATA4</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>DATA5</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>DATA6</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>DATA7</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>TI1R</name>
        <addressOffset>0x190</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>TXRQ</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RTR</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>IDE</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EXID</name>
          <bitOffset>3</bitOffset>
          <bitWidth>18</bitWidth>
        </field>
        <field>
          <name>STID/EXID</name>
          <bitOffset>21</bitOffset>
          <bitWidth>11</bitWidth>
        </field>
      </fields>
      <register>
        <name>TDT1R</name>
        <addressOffset>0x194</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>DLC</name>
          <bitOffset>0</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>TGT</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TIME</name>
          <bitOffset>16</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>TDL1R</name>
        <addressOffset>0x198</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>DATA0</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>DATA1</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>DATA2</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>DATA3</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>TDH1R</name>
        <addressOffset>0x19c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>DATA4</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>DATA5</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>DATA6</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>DATA7</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>TI2R</name>
        <addressOffset>0x1a0</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>TXRQ</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RTR</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>IDE</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EXID</name>
          <bitOffset>3</bitOffset>
          <bitWidth>18</bitWidth>
        </field>
        <field>
          <name>STID/EXID</name>
          <bitOffset>21</bitOffset>
          <bitWidth>11</bitWidth>
        </field>
      </fields>
      <register>
        <name>TDT2R</name>
        <addressOffset>0x1a4</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>DLC</name>
          <bitOffset>0</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>TGT</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TIME</name>
          <bitOffset>16</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>TDL2R</name>
        <addressOffset>0x1a8</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>DATA0</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>DATA1</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>DATA2</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>DATA3</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>TDH2R</name>
        <addressOffset>0x1ac</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>DATA4</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>DATA5</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>DATA6</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>DATA7</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>RI0R</name>
        <addressOffset>0x1b0</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>RTR</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>IDE</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EXID</name>
          <bitOffset>3</bitOffset>
          <bitWidth>18</bitWidth>
        </field>
        <field>
          <name>STID/EXID</name>
          <bitOffset>21</bitOffset>
          <bitWidth>11</bitWidth>
        </field>
      </fields>
      <register>
        <name>RDT0R</name>
        <addressOffset>0x1b4</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>DLC</name>
          <bitOffset>0</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>FMI</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>TIME</name>
          <bitOffset>16</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>RDL0R</name>
        <addressOffset>0x1b8</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>DATA0</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>DATA1</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>DATA2</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>DATA3</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>RDH0R</name>
        <addressOffset>0x1bc</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>DATA4</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>DATA5</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>DATA6</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>DATA7</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>RI1R</name>
        <addressOffset>0x1c0</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>RTR</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>IDE</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EXID</name>
          <bitOffset>3</bitOffset>
          <bitWidth>18</bitWidth>
        </field>
        <field>
          <name>STID/EXID</name>
          <bitOffset>21</bitOffset>
          <bitWidth>11</bitWidth>
        </field>
      </fields>
      <register>
        <name>RDT1R</name>
        <addressOffset>0x1c4</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>DLC</name>
          <bitOffset>0</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>FMI</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>TIME</name>
          <bitOffset>16</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>RDL1R</name>
        <addressOffset>0x1c8</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>DATA0</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>DATA1</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>DATA2</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>DATA3</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>RDH1R</name>
        <addressOffset>0x1cc</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>DATA4</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>DATA5</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>DATA6</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>DATA7</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>FMR</name>
        <addressOffset>0x200</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>FINIT</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CAN2SB</name>
          <bitOffset>8</bitOffset>
          <bitWidth>6</bitWidth>
        </field>
      </fields>
      <register>
        <name>FM1R</name>
        <addressOffset>0x204</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>FBM</name>
          <bitOffset>0</bitOffset>
          <bitWidth>28</bitWidth>
        </field>
      </fields>
      <register>
        <name>FS1R</name>
        <addressOffset>0x20c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>FSC</name>
          <bitOffset>0</bitOffset>
          <bitWidth>28</bitWidth>
        </field>
      </fields>
      <register>
        <name>FFA1R</name>
        <addressOffset>0x214</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>FFA</name>
          <bitOffset>0</bitOffset>
          <bitWidth>28</bitWidth>
        </field>
      </fields>
      <register>
        <name>FA1R</name>
        <addressOffset>0x21c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>FACT</name>
          <bitOffset>0</bitOffset>
          <bitWidth>28</bitWidth>
        </field>
      </fields>
      <register>
        <name>F0R1</name>
        <addressOffset>0x240</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>FB</name>
          <bitOffset>0</bitOffset>
          <bitWidth>32</bitWidth>
        </field>
      </fields>
      <register>
        <name>F0R2</name>
        <addressOffset>0x244</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>FB</name>
          <bitOffset>0</bitOffset>
          <bitWidth>32</bitWidth>
        </field>
      </fields>
      <register>
        <name>F1R1</name>
        <addressOffset>0x248</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>FB</name>
          <bitOffset>0</bitOffset>
          <bitWidth>32</bitWidth>
        </field>
      </fields>
      <register>
        <name>F1R2</name>
        <addressOffset>0x24c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>FB</name>
          <bitOffset>0</bitOffset>
          <bitWidth>32</bitWidth>
        </field>
      </fields>
      <register>
        <name>F27R1</name>
        <addressOffset>0x318</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>FB</name>
          <bitOffset>0</bitOffset>
          <bitWidth>32</bitWidth>
        </field>
      </fields>
      <register>
        <name>F27R2</name>
        <addressOffset>0x31c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>FB</name>
          <bitOffset>0</bitOffset>
          <bitWidth>32</bitWidth>
        </field>
      </fields>
    </peripheral>
    <peripheral>
      <name>BKP</name>
      <baseAddress>0x40006c00</baseAddress>
      <register>
        <name>RTCCR</name>
        <addressOffset>0x2</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>CAL</name>
          <bitOffset>0</bitOffset>
          <bitWidth>7</bitWidth>
        </field>
        <field>
          <name>CCO</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ASOE</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ASOS</name>
          <bitOffset>9</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>DR1</name>
        <addressOffset>0x4</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>D</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>DR2</name>
        <addressOffset>0x8</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>D</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>DR3</name>
        <addressOffset>0xc</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>D</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>DR4</name>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>D</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>DR5</name>
        <addressOffset>0x14</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>D</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>DR6</name>
        <addressOffset>0x18</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>D</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>DR7</name>
        <addressOffset>0x1c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>D</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>DR8</name>
        <addressOffset>0x20</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>D</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>DR9</name>
        <addressOffset>0x24</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>D</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>DR10</name>
        <addressOffset>0x28</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>D</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>CR</name>
        <addressOffset>0x30</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>TPE</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TPAL</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>CSR</name>
        <addressOffset>0x34</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>CTE</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CTI</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TPIE</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TEF</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TIF</name>
          <bitOffset>9</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>DR11</name>
        <addressOffset>0x40</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>D</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>DR12</name>
        <addressOffset>0x44</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>D</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>DR13</name>
        <addressOffset>0x48</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>D</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>DR14</name>
        <addressOffset>0x4c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>D</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>DR15</name>
        <addressOffset>0x50</addressOffset>
        <size>0x20</size>
      </register>
