modm-ext/archive-stmicro-svd/rm_rm0008_stm32f101c4t6.svd
      <fields>
        <field>
          <name>D</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>DR16</name>
        <addressOffset>0x54</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>D</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>DR17</name>
        <addressOffset>0x58</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>D</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>DR18</name>
        <addressOffset>0x5c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>D</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>DR19</name>
        <addressOffset>0x60</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>D</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>DR20</name>
        <addressOffset>0x64</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>D</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>DR21</name>
        <addressOffset>0x68</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>D</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>DR22</name>
        <addressOffset>0x6c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>D</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>DR23</name>
        <addressOffset>0x70</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>D</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>DR24</name>
        <addressOffset>0x74</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>D</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>DR25</name>
        <addressOffset>0x78</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>D</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>DR26</name>
        <addressOffset>0x7c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>D</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>DR27</name>
        <addressOffset>0x80</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>D</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>DR28</name>
        <addressOffset>0x84</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>D</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>DR29</name>
        <addressOffset>0x88</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>D</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>DR30</name>
        <addressOffset>0x8c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>D</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>DR31</name>
        <addressOffset>0x90</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>D</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>DR32</name>
        <addressOffset>0x94</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>D</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>DR33</name>
        <addressOffset>0x98</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>D</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>DR34</name>
        <addressOffset>0x9c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>D</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>DR35</name>
        <addressOffset>0xa0</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>D</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>DR36</name>
        <addressOffset>0xa4</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>D</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>DR37</name>
        <addressOffset>0xa8</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>D</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>DR38</name>
        <addressOffset>0xac</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>D</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>DR39</name>
        <addressOffset>0xb0</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>D</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>DR40</name>
        <addressOffset>0xb4</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>D</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>DR41</name>
        <addressOffset>0xb8</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>D</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>DR42</name>
        <addressOffset>0xbc</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>D</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
    </peripheral>
    <peripheral>
      <name>PWR</name>
      <baseAddress>0x40007000</baseAddress>
      <register>
        <name>CR</name>
        <addressOffset>0x0</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>LPDS</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>PDDS</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CWUF</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CSBF</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>PVDE</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>PLS</name>
          <bitOffset>5</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>DBP</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>CSR</name>
        <addressOffset>0x4</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>WUF</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>SBF</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>PVDO</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EWUP</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
    </peripheral>
    <peripheral>
      <name>DAC</name>
      <baseAddress>0x40007400</baseAddress>
      <register>
        <name>CR</name>
        <addressOffset>0x0</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>EN1</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>BOFF1</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TEN1</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TSEL1</name>
          <bitOffset>3</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>WAVE1</name>
          <bitOffset>6</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>MAMP1</name>
          <bitOffset>8</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>DMAEN1</name>
          <bitOffset>12</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>s</name>
          <bitOffset>13</bitOffset>
          <bitWidth>19</bitWidth>
        </field>
        <field>
          <name>EN2</name>
          <bitOffset>16</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>BOFF2</name>
          <bitOffset>17</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TEN2</name>
          <bitOffset>18</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TSEL2</name>
          <bitOffset>19</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>WAVE2</name>
          <bitOffset>22</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>MAMP2</name>
          <bitOffset>24</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>DMAEN2</name>
          <bitOffset>28</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>SWTRIGR</name>
        <addressOffset>0x4</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>SWTRIG1</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>SWTRIG2</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>DHR12R1</name>
        <addressOffset>0x8</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>DACC1DHR</name>
          <bitOffset>0</bitOffset>
          <bitWidth>12</bitWidth>
        </field>
      </fields>
      <register>
        <name>DHR12L1</name>
        <addressOffset>0xc</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>DACC1DHR</name>
          <bitOffset>4</bitOffset>
          <bitWidth>12</bitWidth>
        </field>
      </fields>
      <register>
        <name>DHR8R1</name>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>DACC1DHR</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>DHR12R2</name>
        <addressOffset>0x14</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>DACC2DHR</name>
          <bitOffset>0</bitOffset>
          <bitWidth>12</bitWidth>
        </field>
      </fields>
      <register>
        <name>DHR12L2</name>
        <addressOffset>0x18</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>DACC2DHR</name>
          <bitOffset>4</bitOffset>
          <bitWidth>12</bitWidth>
        </field>
      </fields>
      <register>
        <name>DHR8R2</name>
        <addressOffset>0x1c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>DACC2DHR</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>DHR12RD</name>
        <addressOffset>0x20</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>DACC1DHR</name>
          <bitOffset>0</bitOffset>
          <bitWidth>12</bitWidth>
        </field>
        <field>
          <name>DACC2DHR</name>
          <bitOffset>16</bitOffset>
          <bitWidth>12</bitWidth>
        </field>
      </fields>
      <register>
        <name>DHR12LD</name>
        <addressOffset>0x24</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>DACC1DHR</name>
          <bitOffset>4</bitOffset>
          <bitWidth>12</bitWidth>
        </field>
        <field>
          <name>DACC2DHR</name>
          <bitOffset>20</bitOffset>
          <bitWidth>12</bitWidth>
        </field>
      </fields>
      <register>
        <name>DHR8RD</name>
        <addressOffset>0x28</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>DACC1DHR</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>DACC2DHR</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>DOR1</name>
        <addressOffset>0x2c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>DACC1DOR</name>
          <bitOffset>0</bitOffset>
          <bitWidth>12</bitWidth>
        </field>
      </fields>
      <register>
        <name>DOR2</name>
        <addressOffset>0x30</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>DACC2DOR</name>
          <bitOffset>0</bitOffset>
          <bitWidth>12</bitWidth>
        </field>
      </fields>
    </peripheral>
    <peripheral>
      <name>AFIO</name>
      <baseAddress>0x40010000</baseAddress>
      <register>
        <name>EVCR</name>
        <addressOffset>0x0</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>PIN</name>
          <bitOffset>0</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>PORT</name>
          <bitOffset>3</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>EVOE</name>
          <bitOffset>6</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>MAPR</name>
        <addressOffset>0x4</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>SPI1_REMAP</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>I2C1_REMAP</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>USART1_REMAP</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>USART2_REMAP</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>USART3_REMAP</name>
          <bitOffset>4</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>TIM1_REMPAP</name>
          <bitOffset>6</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>TIM2_REMPAP</name>
          <bitOffset>8</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>TIM3_REMPAP</name>
          <bitOffset>10</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>TIM4_REMPAP</name>
          <bitOffset>12</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CAN1_REMAP</name>
          <bitOffset>13</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>PD01_REMAP</name>
          <bitOffset>15</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TIM5CH4_IREMAP</name>
          <bitOffset>16</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ADC1_ETRGINJ_REMAP</name>
          <bitOffset>17</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ADC1_ETRGREG_REMAP</name>
          <bitOffset>18</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ADC2_ETRGINJ_REMAP</name>
          <bitOffset>19</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ADC2_ETRGREG_REMAP</name>
          <bitOffset>20</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>SWJ_CFG</name>
          <bitOffset>24</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
      </fields>
      <register>
        <name>EXTICR1</name>
        <addressOffset>0x8</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>EXTI0</name>
          <bitOffset>0</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>EXTI1</name>
          <bitOffset>4</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>EXTI2</name>
          <bitOffset>8</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>EXTI3</name>
          <bitOffset>12</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
      </fields>
      <register>
        <name>EXTICR2</name>
        <addressOffset>0xc</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>EXTI4</name>
          <bitOffset>0</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>EXTI5</name>
          <bitOffset>4</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>EXTI6</name>
          <bitOffset>8</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>EXTI7</name>
          <bitOffset>12</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
      </fields>
      <register>
        <name>EXTICR3</name>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>EXTI8</name>
          <bitOffset>0</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>EXTI9</name>
          <bitOffset>4</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>EXTI10</name>
          <bitOffset>8</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>EXTI11</name>
          <bitOffset>12</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
      </fields>
      <register>
        <name>EXTICR4</name>
        <addressOffset>0x14</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>EXTI12</name>
          <bitOffset>0</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>EXTI13</name>
          <bitOffset>4</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>EXTI14</name>
          <bitOffset>8</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>EXTI15</name>
          <bitOffset>12</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
      </fields>
      <register>
        <name>MAPR2</name>
        <addressOffset>0x1c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>TIM15_REMAP</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TIM16_REMAP</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TIM17_REMAP</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CEC_REMAP</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TIM1_DMA_REMAP</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>s</name>
          <bitOffset>5</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>TIM13_REMAP</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TIM14_REMAP</name>
          <bitOffset>9</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>FSMC_NADV</name>
          <bitOffset>10</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TIM67_DAC_DMA_REMAP</name>
          <bitOffset>11</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TIM12_REMAP</name>
          <bitOffset>12</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>MISC_REMAP</name>
          <bitOffset>13</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
    </peripheral>
