modm-ext/archive-stmicro-svd/rm_rm0008_stm32f101c4t6.svd
    <peripheral>
      <name>EXTI</name>
      <baseAddress>0x40010400</baseAddress>
      <register>
        <name>IMR</name>
        <addressOffset>0x0</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>MR</name>
          <bitOffset>0</bitOffset>
          <bitWidth>20</bitWidth>
        </field>
      </fields>
      <register>
        <name>EMR</name>
        <addressOffset>0x4</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>MR</name>
          <bitOffset>0</bitOffset>
          <bitWidth>20</bitWidth>
        </field>
      </fields>
      <register>
        <name>RTSR</name>
        <addressOffset>0x8</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>TR</name>
          <bitOffset>0</bitOffset>
          <bitWidth>20</bitWidth>
        </field>
      </fields>
      <register>
        <name>FTSR</name>
        <addressOffset>0xc</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>TR</name>
          <bitOffset>0</bitOffset>
          <bitWidth>20</bitWidth>
        </field>
      </fields>
      <register>
        <name>SWIER</name>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>SWIER</name>
          <bitOffset>0</bitOffset>
          <bitWidth>20</bitWidth>
        </field>
      </fields>
      <register>
        <name>PR</name>
        <addressOffset>0x14</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>PR</name>
          <bitOffset>0</bitOffset>
          <bitWidth>20</bitWidth>
        </field>
      </fields>
    </peripheral>
    <peripheral>
      <name>GPIOA</name>
      <baseAddress>0x40010800</baseAddress>
      <register>
        <name>CRL</name>
        <addressOffset>0x0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CRH</name>
        <addressOffset>0x4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>IDR</name>
        <addressOffset>0x8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>ODR</name>
        <addressOffset>0xc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BSRR</name>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BRR</name>
        <addressOffset>0x14</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LCKR</name>
        <addressOffset>0x18</addressOffset>
        <size>0x20</size>
      </register>
    </peripheral>
    <peripheral>
      <name>GPIOB</name>
      <baseAddress>0x40010c00</baseAddress>
      <register>
        <name>CRL</name>
        <addressOffset>0x0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CRH</name>
        <addressOffset>0x4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>IDR</name>
        <addressOffset>0x8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>ODR</name>
        <addressOffset>0xc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BSRR</name>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BRR</name>
        <addressOffset>0x14</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LCKR</name>
        <addressOffset>0x18</addressOffset>
        <size>0x20</size>
      </register>
    </peripheral>
    <peripheral>
      <name>GPIOC</name>
      <baseAddress>0x40011000</baseAddress>
      <register>
        <name>CRL</name>
        <addressOffset>0x0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CRH</name>
        <addressOffset>0x4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>IDR</name>
        <addressOffset>0x8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>ODR</name>
        <addressOffset>0xc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BSRR</name>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BRR</name>
        <addressOffset>0x14</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LCKR</name>
        <addressOffset>0x18</addressOffset>
        <size>0x20</size>
      </register>
    </peripheral>
    <peripheral>
      <name>GPIOD</name>
      <baseAddress>0x40011400</baseAddress>
      <register>
        <name>CRL</name>
        <addressOffset>0x0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CRH</name>
        <addressOffset>0x4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>IDR</name>
        <addressOffset>0x8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>ODR</name>
        <addressOffset>0xc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BSRR</name>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BRR</name>
        <addressOffset>0x14</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LCKR</name>
        <addressOffset>0x18</addressOffset>
        <size>0x20</size>
      </register>
    </peripheral>
    <peripheral>
      <name>GPIOE</name>
      <baseAddress>0x40011800</baseAddress>
      <register>
        <name>CRL</name>
        <addressOffset>0x0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CRH</name>
        <addressOffset>0x4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>IDR</name>
        <addressOffset>0x8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>ODR</name>
        <addressOffset>0xc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BSRR</name>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BRR</name>
        <addressOffset>0x14</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LCKR</name>
        <addressOffset>0x18</addressOffset>
        <size>0x20</size>
      </register>
    </peripheral>
    <peripheral>
      <name>GPIOF</name>
      <baseAddress>0x40011c00</baseAddress>
      <register>
        <name>CRL</name>
        <addressOffset>0x0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CRH</name>
        <addressOffset>0x4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>IDR</name>
        <addressOffset>0x8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>ODR</name>
        <addressOffset>0xc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BSRR</name>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BRR</name>
        <addressOffset>0x14</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LCKR</name>
        <addressOffset>0x18</addressOffset>
        <size>0x20</size>
      </register>
    </peripheral>
    <peripheral>
      <name>GPIOG</name>
      <baseAddress>0x40012000</baseAddress>
      <register>
        <name>CRL</name>
        <addressOffset>0x0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CRH</name>
        <addressOffset>0x4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>IDR</name>
        <addressOffset>0x8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>ODR</name>
        <addressOffset>0xc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BSRR</name>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BRR</name>
        <addressOffset>0x14</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LCKR</name>
        <addressOffset>0x18</addressOffset>
        <size>0x20</size>
      </register>
    </peripheral>
    <peripheral>
      <name>ADC1</name>
      <baseAddress>0x40012400</baseAddress>
      <register>
        <name>SR</name>
        <addressOffset>0x0</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>AWD</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EOC</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>JEOC</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>JSTRT</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>STRT</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>CR1</name>
        <addressOffset>0x4</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>AWDCH</name>
          <bitOffset>0</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>EOCIE</name>
          <bitOffset>5</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>AWDIE</name>
          <bitOffset>6</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>JEOCIE</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>SCAN</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>AWDSGL</name>
          <bitOffset>9</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>JAUTO</name>
          <bitOffset>10</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>DISCEN</name>
          <bitOffset>11</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>JDISCEN</name>
          <bitOffset>12</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>DISCNUM</name>
          <bitOffset>13</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>DUALMOD</name>
          <bitOffset>16</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>JAWDEN</name>
          <bitOffset>22</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>AWDEN</name>
          <bitOffset>23</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>CR2</name>
        <addressOffset>0x8</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>ADON</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CONT</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CAL</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RSTCAL</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>DMA</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ALIGN</name>
          <bitOffset>11</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>JEXTSEL</name>
          <bitOffset>12</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>JEXTTRIG</name>
          <bitOffset>15</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EXTSEL</name>
          <bitOffset>17</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>EXTTRIG</name>
          <bitOffset>20</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>JSWSTAR</name>
          <bitOffset>21</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>SWSTART</name>
          <bitOffset>22</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TSVREFE</name>
          <bitOffset>23</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>SMPR1</name>
        <addressOffset>0xc</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>SMP</name>
          <bitOffset>0</bitOffset>
          <bitWidth>32</bitWidth>
        </field>
      </fields>
      <register>
        <name>SMPR2</name>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>SMP</name>
          <bitOffset>0</bitOffset>
          <bitWidth>32</bitWidth>
        </field>
      </fields>
      <register>
        <name>JOFR1</name>
        <addressOffset>0x14</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>JOFFSET1</name>
          <bitOffset>0</bitOffset>
          <bitWidth>12</bitWidth>
        </field>
      </fields>
      <register>
        <name>JOFR2</name>
        <addressOffset>0x18</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>JOFFSET2</name>
          <bitOffset>0</bitOffset>
          <bitWidth>12</bitWidth>
        </field>
      </fields>
      <register>
        <name>JOFR3</name>
        <addressOffset>0x1c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>JOFFSET3</name>
          <bitOffset>0</bitOffset>
          <bitWidth>12</bitWidth>
        </field>
      </fields>
      <register>
        <name>JOFR4</name>
        <addressOffset>0x20</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>JOFFSET4</name>
          <bitOffset>0</bitOffset>
          <bitWidth>12</bitWidth>
        </field>
      </fields>
      <register>
        <name>HTR</name>
        <addressOffset>0x24</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>HT</name>
          <bitOffset>0</bitOffset>
          <bitWidth>12</bitWidth>
        </field>
      </fields>
      <register>
        <name>LTR</name>
        <addressOffset>0x28</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>LT</name>
          <bitOffset>0</bitOffset>
          <bitWidth>12</bitWidth>
        </field>
      </fields>
      <register>
        <name>SQR1</name>
        <addressOffset>0x2c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>SQ13conversioningularsequencebits</name>
          <bitOffset>0</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>SQ141conversioningularsequencebits</name>
          <bitOffset>5</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>SQ15conversioningularsequencebits</name>
          <bitOffset>10</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>SQ16conversioningularsequencebits</name>
          <bitOffset>15</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>L</name>
          <bitOffset>20</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
      </fields>
      <register>
        <name>SQR2</name>
        <addressOffset>0x30</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>SQ7conversioningularsequencebits</name>
          <bitOffset>0</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>SQ8conversioningularsequencebits</name>
          <bitOffset>5</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>SQ9conversioningularsequencebits</name>
          <bitOffset>10</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>SQ10conversioningularsequencebits</name>
          <bitOffset>15</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>SQ11conversioningularsequencebits</name>
          <bitOffset>20</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>SQ12conversioningularsequencebits</name>
          <bitOffset>25</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
      </fields>
      <register>
        <name>SQR3</name>
        <addressOffset>0x34</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>SQ1conversioningularsequencebits</name>
          <bitOffset>0</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>SQ2conversioningularsequencebits</name>
          <bitOffset>5</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>SQ3conversioningularsequencebits</name>
          <bitOffset>10</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>SQ4conversioningularsequencebits</name>
          <bitOffset>15</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>SQ5conversioningularsequencebits</name>
          <bitOffset>20</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>SQ6conversioningularsequencebits</name>
          <bitOffset>25</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
      </fields>
      <register>
        <name>JSQR</name>
        <addressOffset>0x38</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>JSQ1</name>
          <bitOffset>0</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>JSQ2</name>
          <bitOffset>5</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>JSQ3</name>
          <bitOffset>10</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>JSQ4</name>
          <bitOffset>15</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>JL</name>
          <bitOffset>20</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
      </fields>
      <register>
        <name>JDR1</name>
        <addressOffset>0x3c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>JDATA</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>JDR2</name>
        <addressOffset>0x40</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>JDATA</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>JDR3</name>
        <addressOffset>0x44</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>JDATA</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>JDR4</name>
        <addressOffset>0x48</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>JDATA</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>DR</name>
        <addressOffset>0x4c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>gularDATA</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
        <field>
          <name>ADC2DATA</name>
          <bitOffset>16</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
    </peripheral>
    <peripheral>
      <name>ADC2</name>
      <baseAddress>0x40012800</baseAddress>
      <register>
        <name>SR</name>
        <addressOffset>0x0</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>AWD</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EOC</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>JEOC</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>JSTRT</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>STRT</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>CR1</name>
        <addressOffset>0x4</addressOffset>
        <size>0x20</size>
      </register>
