modm-ext/archive-stmicro-svd/rm_rm0008_stm32f101c4t6.svd
      <fields>
        <field>
          <name>JOFFSET1</name>
          <bitOffset>0</bitOffset>
          <bitWidth>12</bitWidth>
        </field>
      </fields>
      <register>
        <name>JOFR2</name>
        <addressOffset>0x18</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>JOFFSET2</name>
          <bitOffset>0</bitOffset>
          <bitWidth>12</bitWidth>
        </field>
      </fields>
      <register>
        <name>JOFR3</name>
        <addressOffset>0x1c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>JOFFSET3</name>
          <bitOffset>0</bitOffset>
          <bitWidth>12</bitWidth>
        </field>
      </fields>
      <register>
        <name>JOFR4</name>
        <addressOffset>0x20</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>JOFFSET4</name>
          <bitOffset>0</bitOffset>
          <bitWidth>12</bitWidth>
        </field>
      </fields>
      <register>
        <name>HTR</name>
        <addressOffset>0x24</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>HT</name>
          <bitOffset>0</bitOffset>
          <bitWidth>12</bitWidth>
        </field>
      </fields>
      <register>
        <name>LTR</name>
        <addressOffset>0x28</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>LT</name>
          <bitOffset>0</bitOffset>
          <bitWidth>12</bitWidth>
        </field>
      </fields>
      <register>
        <name>SQR1</name>
        <addressOffset>0x2c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>SQ13conversioningularsequencebits</name>
          <bitOffset>0</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>SQ141conversioningularsequencebits</name>
          <bitOffset>5</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>SQ15conversioningularsequencebits</name>
          <bitOffset>10</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>SQ16conversioningularsequencebits</name>
          <bitOffset>15</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>L</name>
          <bitOffset>20</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
      </fields>
      <register>
        <name>SQR2</name>
        <addressOffset>0x30</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>SQ7conversioningularsequencebits</name>
          <bitOffset>0</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>SQ8conversioningularsequencebits</name>
          <bitOffset>5</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>SQ9conversioningularsequencebits</name>
          <bitOffset>10</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>SQ10conversioningularsequencebits</name>
          <bitOffset>15</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>SQ11conversioningularsequencebits</name>
          <bitOffset>20</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>SQ12conversioningularsequencebits</name>
          <bitOffset>25</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
      </fields>
      <register>
        <name>SQR3</name>
        <addressOffset>0x34</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>SQ1conversioningularsequencebits</name>
          <bitOffset>0</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>SQ2conversioningularsequencebits</name>
          <bitOffset>5</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>SQ3conversioningularsequencebits</name>
          <bitOffset>10</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>SQ4conversioningularsequencebits</name>
          <bitOffset>15</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>SQ5conversioningularsequencebits</name>
          <bitOffset>20</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>SQ6conversioningularsequencebits</name>
          <bitOffset>25</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
      </fields>
      <register>
        <name>JSQR</name>
        <addressOffset>0x38</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>JSQ1</name>
          <bitOffset>0</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>JSQ2</name>
          <bitOffset>5</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>JSQ3</name>
          <bitOffset>10</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>JSQ4</name>
          <bitOffset>15</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>JL</name>
          <bitOffset>20</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
      </fields>
      <register>
        <name>JDR1</name>
        <addressOffset>0x3c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>JDATA</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>JDR2</name>
        <addressOffset>0x40</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>JDATA</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>JDR3</name>
        <addressOffset>0x44</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>JDATA</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>JDR4</name>
        <addressOffset>0x48</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>JDATA</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>DR</name>
        <addressOffset>0x4c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>gularDATA</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
        <field>
          <name>ADC2DATA</name>
          <bitOffset>16</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
    </peripheral>
    <peripheral>
      <name>TIM9</name>
      <baseAddress>0x40014c00</baseAddress>
      <register>
        <name>CR1</name>
        <addressOffset>0x0</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>CEN</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>UDIS</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>URS</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>OPM</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ARPE</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CKD</name>
          <bitOffset>8</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
      </fields>
      <register>
        <name>SMCR</name>
        <addressOffset>0x8</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>SMS</name>
          <bitOffset>0</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>TS</name>
          <bitOffset>4</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
      </fields>
      <register>
        <name>DIER</name>
        <addressOffset>0xc</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>UIE</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CC1IE</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CC2IE</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TIE</name>
          <bitOffset>6</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>SR</name>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>UIF</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CC1IF</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CC2IF</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TIF</name>
          <bitOffset>6</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CC1OF</name>
          <bitOffset>9</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CC2OF</name>
          <bitOffset>10</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>EGR</name>
        <addressOffset>0x14</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>UG</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CC1G</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CC2G</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TG</name>
          <bitOffset>6</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>CCMR1_OUT</name>
        <addressOffset>0x18</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>CC1S</name>
          <bitOffset>0</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>OC1FE</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>OC1PE</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>OC1M</name>
          <bitOffset>4</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>CC2S</name>
          <bitOffset>8</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>OC2FE</name>
          <bitOffset>10</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>OC2PE</name>
          <bitOffset>11</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>OC2M</name>
          <bitOffset>12</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
      </fields>
      <register>
        <name>CCMR1_IN</name>
        <addressOffset>0x18</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>CC1S</name>
          <bitOffset>0</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>IC1PSC</name>
          <bitOffset>2</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>IC1F</name>
          <bitOffset>4</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>CC2S</name>
          <bitOffset>8</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>IC2PSC</name>
          <bitOffset>10</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>IC2F</name>
          <bitOffset>12</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
      </fields>
      <register>
        <name>CCER</name>
        <addressOffset>0x20</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>CC1E</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CC1P</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CC1NP</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CC2E</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CC2P</name>
          <bitOffset>5</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CC2NP</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>CNT</name>
        <addressOffset>0x24</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>CNT</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>PSC</name>
        <addressOffset>0x28</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>PSC</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>ARR</name>
        <addressOffset>0x2c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>ARR</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>CCR1</name>
        <addressOffset>0x34</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>CCR1</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>CCR2</name>
        <addressOffset>0x38</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>CCR2</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
    </peripheral>
    <peripheral>
      <name>TIM10</name>
      <baseAddress>0x40015000</baseAddress>
      <register>
        <name>CR1</name>
        <addressOffset>0x0</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>CEN</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>UDIS</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>URS</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>OPM</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ARPE</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CKD</name>
          <bitOffset>8</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
      </fields>
      <register>
        <name>SMCR</name>
        <addressOffset>0x8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DIER</name>
        <addressOffset>0xc</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>UIE</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CC1IE</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>SR</name>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>UIF</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CC1IF</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CC1OF</name>
          <bitOffset>9</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>EGR</name>
        <addressOffset>0x14</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>UG</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CC1G</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>CCMR1_OUT</name>
        <addressOffset>0x18</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>CC1S</name>
          <bitOffset>0</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>OC1FE</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>OC1PE</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>OC1M</name>
          <bitOffset>4</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
      </fields>
      <register>
        <name>CCMR1_IN</name>
        <addressOffset>0x18</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>CC1S</name>
          <bitOffset>0</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>IC1PSC</name>
          <bitOffset>2</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>IC1F</name>
          <bitOffset>4</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
      </fields>
      <register>
        <name>CCER</name>
        <addressOffset>0x20</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>CC1E</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CC1P</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CC1NP</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>CNT</name>
        <addressOffset>0x24</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>CNT</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>PSC</name>
        <addressOffset>0x28</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>PSC</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>ARR</name>
        <addressOffset>0x2c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>ARR</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>CCR1</name>
        <addressOffset>0x34</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>CCR1</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
    </peripheral>
    <peripheral>
      <name>TIM11</name>
      <baseAddress>0x40015400</baseAddress>
      <register>
        <name>CR1</name>
        <addressOffset>0x0</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>CEN</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>UDIS</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>URS</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>OPM</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ARPE</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CKD</name>
          <bitOffset>8</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
      </fields>
      <register>
        <name>SMCR</name>
        <addressOffset>0x8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DIER</name>
        <addressOffset>0xc</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>UIE</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CC1IE</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>SR</name>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>UIF</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CC1IF</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CC1OF</name>
          <bitOffset>9</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>EGR</name>
        <addressOffset>0x14</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>UG</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CC1G</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>CCMR1_OUT</name>
        <addressOffset>0x18</addressOffset>
        <size>0x20</size>
      </register>
