modm-ext/archive-stmicro-svd/rm_rm0008_stm32f101c4t6.svd
      <fields>
        <field>
          <name>CC1S</name>
          <bitOffset>0</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>OC1FE</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>OC1PE</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>OC1M</name>
          <bitOffset>4</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
      </fields>
      <register>
        <name>CCMR1_IN</name>
        <addressOffset>0x18</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>CC1S</name>
          <bitOffset>0</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>IC1PSC</name>
          <bitOffset>2</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>IC1F</name>
          <bitOffset>4</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
      </fields>
      <register>
        <name>CCER</name>
        <addressOffset>0x20</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>CC1E</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CC1P</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CC1NP</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>CNT</name>
        <addressOffset>0x24</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>CNT</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>PSC</name>
        <addressOffset>0x28</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>PSC</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>ARR</name>
        <addressOffset>0x2c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>ARR</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>CCR1</name>
        <addressOffset>0x34</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>CCR1</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
    </peripheral>
    <peripheral>
      <name>SDIO</name>
      <baseAddress>0x40018000</baseAddress>
      <register>
        <name>POWER</name>
        <addressOffset>0x0</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>PWRCTRL</name>
          <bitOffset>0</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
      </fields>
      <register>
        <name>CLKCR</name>
        <addressOffset>0x4</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>CLKDIV</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>CLKEN</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>PWRSAV</name>
          <bitOffset>9</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>BYPASS</name>
          <bitOffset>10</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>WIDBUS</name>
          <bitOffset>11</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>NEGEDGE</name>
          <bitOffset>13</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>HWFC_EN</name>
          <bitOffset>14</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>ARG</name>
        <addressOffset>0x8</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>CMDARG</name>
          <bitOffset>0</bitOffset>
          <bitWidth>32</bitWidth>
        </field>
      </fields>
      <register>
        <name>CMD</name>
        <addressOffset>0xc</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>CMDINDEX</name>
          <bitOffset>0</bitOffset>
          <bitWidth>6</bitWidth>
        </field>
        <field>
          <name>WAITRESP</name>
          <bitOffset>6</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>WAITINT</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>WAITPEND</name>
          <bitOffset>9</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CPSMEN</name>
          <bitOffset>10</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>SDIOSuspend</name>
          <bitOffset>11</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ENCMDcompl</name>
          <bitOffset>12</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>nIEN</name>
          <bitOffset>13</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CEATACMD</name>
          <bitOffset>14</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>RESPCMD</name>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>RESPCMD</name>
          <bitOffset>0</bitOffset>
          <bitWidth>6</bitWidth>
        </field>
      </fields>
      <register>
        <name>RESP1</name>
        <addressOffset>0x14</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>CARDSTATUS1</name>
          <bitOffset>0</bitOffset>
          <bitWidth>32</bitWidth>
        </field>
      </fields>
      <register>
        <name>RESP2</name>
        <addressOffset>0x18</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>CARDSTATUS2</name>
          <bitOffset>0</bitOffset>
          <bitWidth>32</bitWidth>
        </field>
      </fields>
      <register>
        <name>RESP3</name>
        <addressOffset>0x1c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>CARDSTATUS3</name>
          <bitOffset>0</bitOffset>
          <bitWidth>32</bitWidth>
        </field>
      </fields>
      <register>
        <name>RESP4</name>
        <addressOffset>0x20</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>CARDSTATUS4</name>
          <bitOffset>0</bitOffset>
          <bitWidth>32</bitWidth>
        </field>
      </fields>
      <register>
        <name>DTIMER</name>
        <addressOffset>0x24</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>DATATIME</name>
          <bitOffset>0</bitOffset>
          <bitWidth>32</bitWidth>
        </field>
      </fields>
      <register>
        <name>DLEN</name>
        <addressOffset>0x28</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>DATALENGTH</name>
          <bitOffset>0</bitOffset>
          <bitWidth>25</bitWidth>
        </field>
      </fields>
      <register>
        <name>DCTRL</name>
        <addressOffset>0x2c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>DTEN</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>DTDIR</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>DTMODE</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>DMAEN</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>DBLOCKSIZE</name>
          <bitOffset>4</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>RWSTART</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RWSTOP</name>
          <bitOffset>9</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RWMOD</name>
          <bitOffset>10</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>SDIOEN</name>
          <bitOffset>11</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>DCOUNT</name>
        <addressOffset>0x30</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>DATACOUNT</name>
          <bitOffset>0</bitOffset>
          <bitWidth>25</bitWidth>
        </field>
      </fields>
      <register>
        <name>STA</name>
        <addressOffset>0x34</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>CCRCFAIL</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>DCRCFAIL</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CTIMEOUT</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>DTIMEOUT</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TXUNDERR</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RXOVERR</name>
          <bitOffset>5</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CMDREND</name>
          <bitOffset>6</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CMDSENT</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>DATAEND</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>STBITERR</name>
          <bitOffset>9</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>DBCKEND</name>
          <bitOffset>10</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CMDACT</name>
          <bitOffset>11</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TXACT</name>
          <bitOffset>12</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RXACT</name>
          <bitOffset>13</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TXFIFOHE</name>
          <bitOffset>14</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RXFIFOHF</name>
          <bitOffset>15</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TXFIFOF</name>
          <bitOffset>16</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RXFIFOF</name>
          <bitOffset>17</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TXFIFOE</name>
          <bitOffset>18</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RXFIFOE</name>
          <bitOffset>19</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TXDAVL</name>
          <bitOffset>20</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RXDAVL</name>
          <bitOffset>21</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>SDIOIT</name>
          <bitOffset>22</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CEATAEND</name>
          <bitOffset>23</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>ICR</name>
        <addressOffset>0x38</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>CCRCFAILC</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>DCRCFAILC</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CTIMEOUTC</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>DTIMEOUTC</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TXUNDERRC</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RXOVERRC</name>
          <bitOffset>5</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CMDRENDC</name>
          <bitOffset>6</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CMDSENTC</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>DATAENDC</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>STBITERRC</name>
          <bitOffset>9</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>DBCKENDC</name>
          <bitOffset>10</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>SDIOITC</name>
          <bitOffset>22</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CEATAENDC</name>
          <bitOffset>23</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>MASK</name>
        <addressOffset>0x3c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>CCRCFAILIE</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>DCRCFAILIE</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CTIMEOUTIE</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>DTIMEOUTIE</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TXUNDERRIE</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RXOVERRIE</name>
          <bitOffset>5</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CMDRENDIE</name>
          <bitOffset>6</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CMDSENTIE</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>DATAENDIE</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>STBITERRIE</name>
          <bitOffset>9</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>DBCKENDIE</name>
          <bitOffset>10</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CMDACTIE</name>
          <bitOffset>11</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TXACTIE</name>
          <bitOffset>12</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RXACTIE</name>
          <bitOffset>13</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TXFIFOHEIE</name>
          <bitOffset>14</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RXFIFOHFIE</name>
          <bitOffset>15</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TXFIFOFIE</name>
          <bitOffset>16</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RXFIFOFIE</name>
          <bitOffset>17</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TXFIFOEIE</name>
          <bitOffset>18</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RXFIFOEIE</name>
          <bitOffset>19</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TXDAVLIE</name>
          <bitOffset>20</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RXDAVLIE</name>
          <bitOffset>21</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>SDIOITIE</name>
          <bitOffset>22</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CEATAENDIE</name>
          <bitOffset>23</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>FIFOCNT</name>
        <addressOffset>0x48</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>FIFOCOUNT</name>
          <bitOffset>0</bitOffset>
          <bitWidth>24</bitWidth>
        </field>
      </fields>
      <register>
        <name>FIFO</name>
        <addressOffset>0x80</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>FIF0Data</name>
          <bitOffset>0</bitOffset>
          <bitWidth>32</bitWidth>
        </field>
      </fields>
    </peripheral>
    <peripheral>
      <name>DMA1</name>
      <baseAddress>0x40020000</baseAddress>
      <register>
        <name>ISR</name>
        <addressOffset>0x0</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>GIF1</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TCIF1</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>HTIF1</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TEIF1</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>GIF2</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TCIF2</name>
          <bitOffset>5</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>HTIF2</name>
          <bitOffset>6</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TEIF2</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>GIF3</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TCIF3</name>
          <bitOffset>9</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>HTIF3</name>
          <bitOffset>10</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TEIF3</name>
          <bitOffset>11</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>GIF4</name>
          <bitOffset>12</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TCIF4</name>
          <bitOffset>13</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>HTIF4</name>
          <bitOffset>14</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TEIF4</name>
          <bitOffset>15</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>GIF5</name>
          <bitOffset>16</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TCIF5</name>
          <bitOffset>17</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>HTIF5</name>
          <bitOffset>18</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TEIF5</name>
          <bitOffset>19</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>GIF6</name>
          <bitOffset>20</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TCIF6</name>
          <bitOffset>21</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>HTIF6</name>
          <bitOffset>22</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TEIF6</name>
          <bitOffset>23</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>GIF7</name>
          <bitOffset>24</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TCIF7</name>
          <bitOffset>25</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>HTIF7</name>
          <bitOffset>26</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TEIF7</name>
          <bitOffset>27</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>IFCR</name>
        <addressOffset>0x4</addressOffset>
        <size>0x20</size>
      </register>
