modm-ext/archive-stmicro-svd/rm_rm0008_stm32f101c4t6.svd
      <fields>
        <field>
          <name>SRL</name>
          <bitOffset>0</bitOffset>
          <bitWidth>32</bitWidth>
        </field>
      </fields>
      <register>
        <name>DMATDLAR</name>
        <addressOffset>0x1010</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>STL</name>
          <bitOffset>0</bitOffset>
          <bitWidth>32</bitWidth>
        </field>
      </fields>
      <register>
        <name>DMASR</name>
        <addressOffset>0x1014</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>TS</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TPSS</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TBUS</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TJTS</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ROS</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TUS</name>
          <bitOffset>5</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RS</name>
          <bitOffset>6</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RBUS</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RPSS</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RWTS</name>
          <bitOffset>9</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ETS</name>
          <bitOffset>10</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>FBES</name>
          <bitOffset>13</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ERS</name>
          <bitOffset>14</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>AIS</name>
          <bitOffset>15</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>NIS</name>
          <bitOffset>16</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RPS</name>
          <bitOffset>17</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>TPS</name>
          <bitOffset>20</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>EBS</name>
          <bitOffset>23</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>MMCS</name>
          <bitOffset>27</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>PMTS</name>
          <bitOffset>28</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TSTS</name>
          <bitOffset>29</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>DMAOMR</name>
        <addressOffset>0x1018</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>SR</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>OSF</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RTC</name>
          <bitOffset>3</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>FUGF</name>
          <bitOffset>6</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>FEF</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ST</name>
          <bitOffset>13</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TTC</name>
          <bitOffset>14</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>FTF</name>
          <bitOffset>20</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TSF</name>
          <bitOffset>21</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>DFRF</name>
          <bitOffset>24</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RSF</name>
          <bitOffset>25</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>DTCEFD</name>
          <bitOffset>26</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>DMAIER</name>
        <addressOffset>0x101c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>TIE</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TPSIE</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TBUIE</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TJTIE</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ROIE</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TUIE</name>
          <bitOffset>5</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RIE</name>
          <bitOffset>6</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RBUIE</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RPSIE</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RWTIE</name>
          <bitOffset>9</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ETIE</name>
          <bitOffset>10</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>FBEIE</name>
          <bitOffset>13</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ERIE</name>
          <bitOffset>14</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>AISE</name>
          <bitOffset>15</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>NISE</name>
          <bitOffset>16</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>DMAMFBOCR</name>
        <addressOffset>0x1020</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>MFC</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
        <field>
          <name>OMFC</name>
          <bitOffset>16</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>MFA</name>
          <bitOffset>17</bitOffset>
          <bitWidth>11</bitWidth>
        </field>
        <field>
          <name>OFOC</name>
          <bitOffset>28</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>DMACHTDR</name>
        <addressOffset>0x1048</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>HTDAP</name>
          <bitOffset>0</bitOffset>
          <bitWidth>32</bitWidth>
        </field>
      </fields>
      <register>
        <name>DMACHRDR</name>
        <addressOffset>0x104c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>HRDAP</name>
          <bitOffset>0</bitOffset>
          <bitWidth>32</bitWidth>
        </field>
      </fields>
      <register>
        <name>DMACHTBAR</name>
        <addressOffset>0x1050</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>HTBAP</name>
          <bitOffset>0</bitOffset>
          <bitWidth>32</bitWidth>
        </field>
      </fields>
      <register>
        <name>DMACHRBAR</name>
        <addressOffset>0x1054</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>HRBAP</name>
          <bitOffset>0</bitOffset>
          <bitWidth>32</bitWidth>
        </field>
      </fields>
    </peripheral>
    <peripheral>
      <name>USB_OTG_FS</name>
      <baseAddress>0x50000000</baseAddress>
      <register>
        <name>GOTGCTL</name>
        <addressOffset>0x0</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>SRQSCS</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>SRQ</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>HNGSCS</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>HNPRQ</name>
          <bitOffset>9</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>HSHNPEN</name>
          <bitOffset>10</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>DHNPEN</name>
          <bitOffset>11</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CIDSTS</name>
          <bitOffset>16</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>DBCT</name>
          <bitOffset>17</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ASVLD</name>
          <bitOffset>18</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>BSVLD</name>
          <bitOffset>19</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>GOTGINT</name>
        <addressOffset>0x4</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>s</name>
          <bitOffset>0</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>SEDET</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>SRSSCHG</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>HNSSCHG</name>
          <bitOffset>9</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>HNGDET</name>
          <bitOffset>17</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ADTOCHG</name>
          <bitOffset>18</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>DBCDNE</name>
          <bitOffset>19</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>GAHBCFG</name>
        <addressOffset>0x8</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>GINTMSK</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TXFELVL</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>PTXFELVL</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>GUSBCFG</name>
        <addressOffset>0xc</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>TOCAL</name>
          <bitOffset>0</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>PHYSEL</name>
          <bitOffset>6</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>SRPCAP</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>HNPCA</name>
          <bitOffset>9</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TRDT</name>
          <bitOffset>10</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>FHMOD</name>
          <bitOffset>29</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>FDMOD</name>
          <bitOffset>30</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CTXPKT</name>
          <bitOffset>31</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>GRSTCTL</name>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>CSRST</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>HSRST</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>FCRST</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RXFFLSH</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TXFFLSH</name>
          <bitOffset>5</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TXFNUM</name>
          <bitOffset>6</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>AHBIDL</name>
          <bitOffset>31</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>GINTSTS</name>
        <addressOffset>0x14</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>CMOD</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>MMIS</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>OTGINT</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>SOF</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RXFLVL</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>NPTXFE</name>
          <bitOffset>5</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>GINAKEFF</name>
          <bitOffset>6</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>GONAKEFF</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ESUSP</name>
          <bitOffset>10</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>USBSUSP</name>
          <bitOffset>11</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>USBRST</name>
          <bitOffset>12</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ENUMDNE</name>
          <bitOffset>13</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ISOODRP</name>
          <bitOffset>14</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EOPF</name>
          <bitOffset>15</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>IEPINT</name>
          <bitOffset>18</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>OEPINT</name>
          <bitOffset>19</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>IISOIXFR</name>
          <bitOffset>20</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>IPXFR/INCOMPISOOUT</name>
          <bitOffset>21</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>HPRTINT</name>
          <bitOffset>24</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>HCINT</name>
          <bitOffset>25</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>PTXFE</name>
          <bitOffset>26</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CIDSCHG</name>
          <bitOffset>28</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>DISCINT</name>
          <bitOffset>29</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>SRQINT</name>
          <bitOffset>30</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>WKUINT</name>
          <bitOffset>31</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>GINTMSK</name>
        <addressOffset>0x18</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>MMISM</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>OTGINT</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>SOFM</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RXFLVLM</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>NPTXFEM</name>
          <bitOffset>5</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>GINAKEFFM</name>
          <bitOffset>6</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>GONAKEFFM</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ESUSPM</name>
          <bitOffset>10</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>USBSUSPM</name>
          <bitOffset>11</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>USBRST</name>
          <bitOffset>12</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ENUMDNEM</name>
          <bitOffset>13</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ISOODRPM</name>
          <bitOffset>14</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EOPFM</name>
          <bitOffset>15</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>IEPINT</name>
          <bitOffset>18</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>OEPINT</name>
          <bitOffset>19</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>IISOIXFRM</name>
          <bitOffset>20</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>IPXFRM/IISOOXFRM</name>
          <bitOffset>21</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>PRTIM</name>
          <bitOffset>24</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>HCIM</name>
          <bitOffset>25</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>PTXFEM</name>
          <bitOffset>26</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CIDSCHGM</name>
          <bitOffset>28</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>DISCINT</name>
          <bitOffset>29</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>SRQIM</name>
          <bitOffset>30</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>WUIM</name>
          <bitOffset>31</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>GRXSTSR</name>
        <addressOffset>0x20</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>CHNUM</name>
          <bitOffset>0</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>BCNT</name>
          <bitOffset>4</bitOffset>
          <bitWidth>11</bitWidth>
        </field>
        <field>
          <name>DPID</name>
          <bitOffset>15</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>PKTSTS</name>
          <bitOffset>17</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
      </fields>
      <register>
        <name>GRXSTSPR</name>
        <addressOffset>0x20</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>EPNUM</name>
          <bitOffset>0</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>BCNT</name>
          <bitOffset>4</bitOffset>
          <bitWidth>11</bitWidth>
        </field>
        <field>
          <name>DPID</name>
          <bitOffset>15</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>PKTSTS</name>
          <bitOffset>17</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>FRMNUM</name>
          <bitOffset>21</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
      </fields>
      <register>
        <name>GRXFSIZ</name>
        <addressOffset>0x24</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>RXFD</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>HNPTXFSIZ/DIEPTXF0</name>
        <addressOffset>0x28</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>NPTXFSA/TX0FSA</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
        <field>
          <name>NPTXFD/TX0FD</name>
          <bitOffset>16</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>HNPTXSTS</name>
        <addressOffset>0x2c</addressOffset>
        <size>0x20</size>
      </register>
