modm-ext/archive-stmicro-svd/rm_rm0008_stm32f101c4t6.svd
      <fields>
        <field>
          <name>NPTXFSAV</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
        <field>
          <name>NPTQXSAV</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>NPTXQTOP</name>
          <bitOffset>24</bitOffset>
          <bitWidth>7</bitWidth>
        </field>
        <field>
          <name>s</name>
          <bitOffset>31</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>GCCFG</name>
        <addressOffset>0x38</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>PWRDWN</name>
          <bitOffset>16</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>VBUSASEN</name>
          <bitOffset>18</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>VBUSBSEN</name>
          <bitOffset>19</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>SOFOUTEN</name>
          <bitOffset>20</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>CID</name>
        <addressOffset>0x3c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>PRODUCT_ID</name>
          <bitOffset>0</bitOffset>
          <bitWidth>32</bitWidth>
        </field>
      </fields>
      <register>
        <name>HPTXFSIZ</name>
        <addressOffset>0x100</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>PTXSA</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
        <field>
          <name>PTXFSIZ</name>
          <bitOffset>16</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>DIEPTXF1</name>
        <addressOffset>0x104</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>INEPTXSA</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
        <field>
          <name>INEPTXFD</name>
          <bitOffset>16</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>DIEPTXF2</name>
        <addressOffset>0x108</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>INEPTXSA</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
        <field>
          <name>INEPTXFD</name>
          <bitOffset>16</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>DIEPTXF3</name>
        <addressOffset>0x10c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>INEPTXSA</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
        <field>
          <name>INEPTXFD</name>
          <bitOffset>16</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>HCFG</name>
        <addressOffset>0x400</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>FSLSPCS</name>
          <bitOffset>0</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>FSLSS</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>HFIR</name>
        <addressOffset>0x404</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>FRIVL</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>HFNUM</name>
        <addressOffset>0x408</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>FRNUM</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
        <field>
          <name>FTREM</name>
          <bitOffset>16</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>HPTXSTS</name>
        <addressOffset>0x410</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>PTXFSAVL</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
        <field>
          <name>PTXQSAV</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>PTXQTOP</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>HAINT</name>
        <addressOffset>0x414</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>HAINT</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>HAINTMSK</name>
        <addressOffset>0x418</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>HAINTM</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>HPRT</name>
        <addressOffset>0x440</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>PCSTS</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>PCDET</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>PENA</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>PENCHNG</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>POCA</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>POCCHNG</name>
          <bitOffset>5</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>PRES</name>
          <bitOffset>6</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>PSUSP</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>PRST</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>PLSTS</name>
          <bitOffset>10</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>PPWR</name>
          <bitOffset>12</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>PTCTL</name>
          <bitOffset>13</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>PSPD</name>
          <bitOffset>17</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
      </fields>
      <register>
        <name>HCCHAR0</name>
        <addressOffset>0x500</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>MPSIZ</name>
          <bitOffset>0</bitOffset>
          <bitWidth>11</bitWidth>
        </field>
        <field>
          <name>EPNUM</name>
          <bitOffset>11</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>EPDIR</name>
          <bitOffset>15</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>LSDEV</name>
          <bitOffset>17</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EPTYP</name>
          <bitOffset>18</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>MCNT</name>
          <bitOffset>20</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>DAD</name>
          <bitOffset>22</bitOffset>
          <bitWidth>7</bitWidth>
        </field>
        <field>
          <name>ODDFRM</name>
          <bitOffset>29</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CHDIS</name>
          <bitOffset>30</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CHENA</name>
          <bitOffset>31</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>HCINT0</name>
        <addressOffset>0x508</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>XFRC</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CHH</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>STALL</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>NAK</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ACK</name>
          <bitOffset>5</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TXERR</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>BBERR</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>FRMOR</name>
          <bitOffset>9</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>DTERR</name>
          <bitOffset>10</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>HCINTMSK0</name>
        <addressOffset>0x50c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>XFRCM</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CHHM</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>STALLM</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>NAKM</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ACKM</name>
          <bitOffset>5</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TXERRM</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>BBERRM</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>FRMORM</name>
          <bitOffset>9</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>DTERRM</name>
          <bitOffset>10</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>HCTSIZ0</name>
        <addressOffset>0x510</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>XFRSIZ</name>
          <bitOffset>0</bitOffset>
          <bitWidth>19</bitWidth>
        </field>
        <field>
          <name>PKTCNT</name>
          <bitOffset>19</bitOffset>
          <bitWidth>10</bitWidth>
        </field>
        <field>
          <name>DPID</name>
          <bitOffset>29</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
      </fields>
      <register>
        <name>HCCHAR1</name>
        <addressOffset>0x520</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>MPSIZ</name>
          <bitOffset>0</bitOffset>
          <bitWidth>11</bitWidth>
        </field>
        <field>
          <name>EPNUM</name>
          <bitOffset>11</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>EPDIR</name>
          <bitOffset>15</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>LSDEV</name>
          <bitOffset>17</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EPTYP</name>
          <bitOffset>18</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>MCNT</name>
          <bitOffset>20</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>DAD</name>
          <bitOffset>22</bitOffset>
          <bitWidth>7</bitWidth>
        </field>
        <field>
          <name>ODDFRM</name>
          <bitOffset>29</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CHDIS</name>
          <bitOffset>30</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CHENA</name>
          <bitOffset>31</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>HCINT1</name>
        <addressOffset>0x528</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>XFRC</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CHH</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>STALL</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>NAK</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ACK</name>
          <bitOffset>5</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TXERR</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>BBERR</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>FRMOR</name>
          <bitOffset>9</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>DTERR</name>
          <bitOffset>10</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>HCINTMSK1</name>
        <addressOffset>0x52c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>XFRCM</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CHHM</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>STALLM</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>NAKM</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ACKM</name>
          <bitOffset>5</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TXERRM</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>BBERRM</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>FRMORM</name>
          <bitOffset>9</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>DTERRM</name>
          <bitOffset>10</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>HCTSIZ1</name>
        <addressOffset>0x530</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>XFRSIZ</name>
          <bitOffset>0</bitOffset>
          <bitWidth>19</bitWidth>
        </field>
        <field>
          <name>PKTCNT</name>
          <bitOffset>19</bitOffset>
          <bitWidth>10</bitWidth>
        </field>
        <field>
          <name>DPID</name>
          <bitOffset>29</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
      </fields>
      <register>
        <name>HCCHAR2</name>
        <addressOffset>0x540</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>MPSIZ</name>
          <bitOffset>0</bitOffset>
          <bitWidth>11</bitWidth>
        </field>
        <field>
          <name>EPNUM</name>
          <bitOffset>11</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>EPDIR</name>
          <bitOffset>15</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>LSDEV</name>
          <bitOffset>17</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EPTYP</name>
          <bitOffset>18</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>MCNT</name>
          <bitOffset>20</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>DAD</name>
          <bitOffset>22</bitOffset>
          <bitWidth>7</bitWidth>
        </field>
        <field>
          <name>ODDFRM</name>
          <bitOffset>29</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CHDIS</name>
          <bitOffset>30</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CHENA</name>
          <bitOffset>31</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>HCINT2</name>
        <addressOffset>0x548</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>XFRC</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CHH</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>STALL</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>NAK</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ACK</name>
          <bitOffset>5</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TXERR</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>BBERR</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>FRMOR</name>
          <bitOffset>9</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>DTERR</name>
          <bitOffset>10</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>HCINTMSK2</name>
        <addressOffset>0x54c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>XFRCM</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CHHM</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>STALLM</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>NAKM</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ACKM</name>
          <bitOffset>5</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TXERRM</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>BBERRM</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>FRMORM</name>
          <bitOffset>9</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>DTERRM</name>
          <bitOffset>10</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>HCTSIZ2</name>
        <addressOffset>0x550</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>XFRSIZ</name>
          <bitOffset>0</bitOffset>
          <bitWidth>19</bitWidth>
        </field>
        <field>
          <name>PKTCNT</name>
          <bitOffset>19</bitOffset>
          <bitWidth>10</bitWidth>
        </field>
        <field>
          <name>DPID</name>
          <bitOffset>29</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
      </fields>
      <register>
        <name>HCCHAR3</name>
        <addressOffset>0x560</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>MPSIZ</name>
          <bitOffset>0</bitOffset>
          <bitWidth>11</bitWidth>
        </field>
        <field>
          <name>EPNUM</name>
          <bitOffset>11</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>EPDIR</name>
          <bitOffset>15</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>LSDEV</name>
          <bitOffset>17</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EPTYP</name>
          <bitOffset>18</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>MCNT</name>
          <bitOffset>20</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>DAD</name>
          <bitOffset>22</bitOffset>
          <bitWidth>7</bitWidth>
        </field>
        <field>
          <name>ODDFRM</name>
          <bitOffset>29</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CHDIS</name>
          <bitOffset>30</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CHENA</name>
          <bitOffset>31</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>HCINT3</name>
        <addressOffset>0x568</addressOffset>
        <size>0x20</size>
      </register>
