modm-ext/archive-stmicro-svd/rm_rm0008_stm32f101c4t6.svd
      <fields>
        <field>
          <name>XFRC</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CHH</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>STALL</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>NAK</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ACK</name>
          <bitOffset>5</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TXERR</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>BBERR</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>FRMOR</name>
          <bitOffset>9</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>DTERR</name>
          <bitOffset>10</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>HCINTMSK3</name>
        <addressOffset>0x56c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>XFRCM</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CHHM</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>STALLM</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>NAKM</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ACKM</name>
          <bitOffset>5</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TXERRM</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>BBERRM</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>FRMORM</name>
          <bitOffset>9</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>DTERRM</name>
          <bitOffset>10</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>HCTSIZ3</name>
        <addressOffset>0x570</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>XFRSIZ</name>
          <bitOffset>0</bitOffset>
          <bitWidth>19</bitWidth>
        </field>
        <field>
          <name>PKTCNT</name>
          <bitOffset>19</bitOffset>
          <bitWidth>10</bitWidth>
        </field>
        <field>
          <name>DPID</name>
          <bitOffset>29</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
      </fields>
      <register>
        <name>HCCHAR4</name>
        <addressOffset>0x580</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>MPSIZ</name>
          <bitOffset>0</bitOffset>
          <bitWidth>11</bitWidth>
        </field>
        <field>
          <name>EPNUM</name>
          <bitOffset>11</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>EPDIR</name>
          <bitOffset>15</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>LSDEV</name>
          <bitOffset>17</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EPTYP</name>
          <bitOffset>18</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>MCNT</name>
          <bitOffset>20</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>DAD</name>
          <bitOffset>22</bitOffset>
          <bitWidth>7</bitWidth>
        </field>
        <field>
          <name>ODDFRM</name>
          <bitOffset>29</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CHDIS</name>
          <bitOffset>30</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CHENA</name>
          <bitOffset>31</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>HCINT4</name>
        <addressOffset>0x588</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>XFRC</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CHH</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>STALL</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>NAK</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ACK</name>
          <bitOffset>5</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TXERR</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>BBERR</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>FRMOR</name>
          <bitOffset>9</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>DTERR</name>
          <bitOffset>10</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>HCINTMSK4</name>
        <addressOffset>0x58c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>XFRCM</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CHHM</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>STALLM</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>NAKM</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ACKM</name>
          <bitOffset>5</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TXERRM</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>BBERRM</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>FRMORM</name>
          <bitOffset>9</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>DTERRM</name>
          <bitOffset>10</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>HCTSIZ4</name>
        <addressOffset>0x590</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>XFRSIZ</name>
          <bitOffset>0</bitOffset>
          <bitWidth>19</bitWidth>
        </field>
        <field>
          <name>PKTCNT</name>
          <bitOffset>19</bitOffset>
          <bitWidth>10</bitWidth>
        </field>
        <field>
          <name>DPID</name>
          <bitOffset>29</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
      </fields>
      <register>
        <name>HCCHAR5</name>
        <addressOffset>0x5a0</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>MPSIZ</name>
          <bitOffset>0</bitOffset>
          <bitWidth>11</bitWidth>
        </field>
        <field>
          <name>EPNUM</name>
          <bitOffset>11</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>EPDIR</name>
          <bitOffset>15</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>LSDEV</name>
          <bitOffset>17</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EPTYP</name>
          <bitOffset>18</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>MCNT</name>
          <bitOffset>20</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>DAD</name>
          <bitOffset>22</bitOffset>
          <bitWidth>7</bitWidth>
        </field>
        <field>
          <name>ODDFRM</name>
          <bitOffset>29</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CHDIS</name>
          <bitOffset>30</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CHENA</name>
          <bitOffset>31</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>HCINT5</name>
        <addressOffset>0x5a8</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>XFRC</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CHH</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>STALL</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>NAK</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ACK</name>
          <bitOffset>5</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TXERR</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>BBERR</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>FRMOR</name>
          <bitOffset>9</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>DTERR</name>
          <bitOffset>10</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>HCINTMSK5</name>
        <addressOffset>0x5ac</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>XFRCM</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CHHM</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>STALLM</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>NAKM</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ACKM</name>
          <bitOffset>5</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TXERRM</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>BBERRM</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>FRMORM</name>
          <bitOffset>9</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>DTERRM</name>
          <bitOffset>10</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>HCTSIZ5</name>
        <addressOffset>0x5b0</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>XFRSIZ</name>
          <bitOffset>0</bitOffset>
          <bitWidth>19</bitWidth>
        </field>
        <field>
          <name>PKTCNT</name>
          <bitOffset>19</bitOffset>
          <bitWidth>10</bitWidth>
        </field>
        <field>
          <name>DPID</name>
          <bitOffset>29</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
      </fields>
      <register>
        <name>HCCHAR6</name>
        <addressOffset>0x5c0</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>MPSIZ</name>
          <bitOffset>0</bitOffset>
          <bitWidth>11</bitWidth>
        </field>
        <field>
          <name>EPNUM</name>
          <bitOffset>11</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>EPDIR</name>
          <bitOffset>15</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>LSDEV</name>
          <bitOffset>17</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EPTYP</name>
          <bitOffset>18</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>MCNT</name>
          <bitOffset>20</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>DAD</name>
          <bitOffset>22</bitOffset>
          <bitWidth>7</bitWidth>
        </field>
        <field>
          <name>ODDFRM</name>
          <bitOffset>29</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CHDIS</name>
          <bitOffset>30</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CHENA</name>
          <bitOffset>31</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>HCINT6</name>
        <addressOffset>0x5c8</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>XFRC</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CHH</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>STALL</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>NAK</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ACK</name>
          <bitOffset>5</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TXERR</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>BBERR</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>FRMOR</name>
          <bitOffset>9</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>DTERR</name>
          <bitOffset>10</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>HCINTMSK6</name>
        <addressOffset>0x5cc</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>XFRCM</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CHHM</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>STALLM</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>NAKM</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ACKM</name>
          <bitOffset>5</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TXERRM</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>BBERRM</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>FRMORM</name>
          <bitOffset>9</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>DTERRM</name>
          <bitOffset>10</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>HCTSIZ6</name>
        <addressOffset>0x5d0</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>XFRSIZ</name>
          <bitOffset>0</bitOffset>
          <bitWidth>19</bitWidth>
        </field>
        <field>
          <name>PKTCNT</name>
          <bitOffset>19</bitOffset>
          <bitWidth>10</bitWidth>
        </field>
        <field>
          <name>DPID</name>
          <bitOffset>29</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
      </fields>
      <register>
        <name>HCCHAR7</name>
        <addressOffset>0x5e0</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>MPSIZ</name>
          <bitOffset>0</bitOffset>
          <bitWidth>11</bitWidth>
        </field>
        <field>
          <name>EPNUM</name>
          <bitOffset>11</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>EPDIR</name>
          <bitOffset>15</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>LSDEV</name>
          <bitOffset>17</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EPTYP</name>
          <bitOffset>18</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>MCNT</name>
          <bitOffset>20</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>DAD</name>
          <bitOffset>22</bitOffset>
          <bitWidth>7</bitWidth>
        </field>
        <field>
          <name>ODDFRM</name>
          <bitOffset>29</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CHDIS</name>
          <bitOffset>30</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CHENA</name>
          <bitOffset>31</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>HCINT7</name>
        <addressOffset>0x5e8</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>XFRC</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CHH</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>STALL</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>NAK</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ACK</name>
          <bitOffset>5</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TXERR</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>BBERR</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>FRMOR</name>
          <bitOffset>9</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>DTERR</name>
          <bitOffset>10</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>HCINTMSK7</name>
        <addressOffset>0x5ec</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>XFRCM</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CHHM</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>STALLM</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>NAKM</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ACKM</name>
          <bitOffset>5</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TXERRM</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>BBERRM</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>FRMORM</name>
          <bitOffset>9</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>DTERRM</name>
          <bitOffset>10</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>HCTSIZ7</name>
        <addressOffset>0x5f0</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>XFRSIZ</name>
          <bitOffset>0</bitOffset>
          <bitWidth>19</bitWidth>
        </field>
        <field>
          <name>PKTCNT</name>
          <bitOffset>19</bitOffset>
          <bitWidth>10</bitWidth>
        </field>
        <field>
          <name>DPID</name>
          <bitOffset>29</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
      </fields>
      <register>
        <name>DCFG</name>
        <addressOffset>0x800</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>DSPD</name>
          <bitOffset>0</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>NZLSOHSK</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>DAD</name>
          <bitOffset>4</bitOffset>
          <bitWidth>7</bitWidth>
        </field>
        <field>
          <name>PFIVL</name>
          <bitOffset>11</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
      </fields>
      <register>
        <name>DCTL</name>
        <addressOffset>0x804</addressOffset>
        <size>0x20</size>
      </register>
