modm-ext/archive-stmicro-svd/rm_rm0008_stm32f101c4t6.svd
      <fields>
        <field>
          <name>RWUSIG</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>SDIS</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>GINSTS</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>GONSTS</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TCTL</name>
          <bitOffset>4</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>SGINAK</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CGINAK</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>SGONAK</name>
          <bitOffset>9</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CGONAK</name>
          <bitOffset>10</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>POPRGDNE</name>
          <bitOffset>11</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>DSTS</name>
        <addressOffset>0x808</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>SUSPSTS</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ENUMSPD</name>
          <bitOffset>1</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>EERR</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>FNSOF</name>
          <bitOffset>8</bitOffset>
          <bitWidth>14</bitWidth>
        </field>
      </fields>
      <register>
        <name>DIEPMSK</name>
        <addressOffset>0x810</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>XFRCM</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EPDM</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TOM</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ITTXFEMSK</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>INEPNMM</name>
          <bitOffset>5</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>INEPNEM</name>
          <bitOffset>6</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>NAKM</name>
          <bitOffset>13</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>DOEPMSK</name>
        <addressOffset>0x814</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>XFRCM</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EPDM</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>STUPM</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>OTEPDM</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>STSPHSRXM</name>
          <bitOffset>5</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>OUTPKTERRM</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>BERRM</name>
          <bitOffset>12</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>NAKMSK</name>
          <bitOffset>13</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>DAINT</name>
        <addressOffset>0x818</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>IEPINT</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
        <field>
          <name>OEPINT</name>
          <bitOffset>16</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>DAINTMSK</name>
        <addressOffset>0x81c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>IEPM</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
        <field>
          <name>OEPM</name>
          <bitOffset>16</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>DVBUSDIS</name>
        <addressOffset>0x828</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>VBUSDT</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>DVBUSPULSE</name>
        <addressOffset>0x82c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>DVBUSP</name>
          <bitOffset>0</bitOffset>
          <bitWidth>12</bitWidth>
        </field>
      </fields>
      <register>
        <name>DIEPEMPMSK</name>
        <addressOffset>0x834</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>INEPTXFEM</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>DIEPCTL0</name>
        <addressOffset>0x900</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>MPSIZ</name>
          <bitOffset>0</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>USBAEP</name>
          <bitOffset>15</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>NAKSTS</name>
          <bitOffset>17</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EPTYP</name>
          <bitOffset>18</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>STALL</name>
          <bitOffset>21</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TXFNUM</name>
          <bitOffset>22</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>CNAK</name>
          <bitOffset>26</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>SNAK</name>
          <bitOffset>27</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EPDIS</name>
          <bitOffset>30</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EPENA</name>
          <bitOffset>31</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>DIEPINT0</name>
        <addressOffset>0x908</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>XFRC</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EPDISD</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TOC</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ITTXFE</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>INEPNM</name>
          <bitOffset>5</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>INEPNE</name>
          <bitOffset>6</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TXFE</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>PKTDRPSTS</name>
          <bitOffset>11</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>NAK</name>
          <bitOffset>13</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>DIEPTSIZ0</name>
        <addressOffset>0x910</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>XFRSIZ</name>
          <bitOffset>0</bitOffset>
          <bitWidth>7</bitWidth>
        </field>
        <field>
          <name>PKTCNT</name>
          <bitOffset>19</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
      </fields>
      <register>
        <name>DTXFSTS0</name>
        <addressOffset>0x918</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>INEPTFSAV</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>DIEPCTL1</name>
        <addressOffset>0x920</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>MPSIZ</name>
          <bitOffset>0</bitOffset>
          <bitWidth>11</bitWidth>
        </field>
        <field>
          <name>USBAEP</name>
          <bitOffset>15</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EONUM/DPID</name>
          <bitOffset>16</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>NAKSTS</name>
          <bitOffset>17</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EPTYP</name>
          <bitOffset>18</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>STALL</name>
          <bitOffset>21</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TXFNUM</name>
          <bitOffset>22</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>CNAK</name>
          <bitOffset>26</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>SNAK</name>
          <bitOffset>27</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>SD0PID/SEVNFRM</name>
          <bitOffset>28</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>SODDFRM/SD1PID</name>
          <bitOffset>29</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EPDIS</name>
          <bitOffset>30</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EPENA</name>
          <bitOffset>31</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>DIEPINT1</name>
        <addressOffset>0x928</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>XFRC</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EPDISD</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TOC</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ITTXFE</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>INEPNM</name>
          <bitOffset>5</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>INEPNE</name>
          <bitOffset>6</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TXFE</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>PKTDRPSTS</name>
          <bitOffset>11</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>NAK</name>
          <bitOffset>13</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>DIEPTSIZ1</name>
        <addressOffset>0x930</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>XFRSIZ</name>
          <bitOffset>0</bitOffset>
          <bitWidth>19</bitWidth>
        </field>
        <field>
          <name>PKTCNT</name>
          <bitOffset>19</bitOffset>
          <bitWidth>10</bitWidth>
        </field>
      </fields>
      <register>
        <name>DTXFSTS1</name>
        <addressOffset>0x938</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>INEPTFSAV</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>DIEPCTL2</name>
        <addressOffset>0x940</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>MPSIZ</name>
          <bitOffset>0</bitOffset>
          <bitWidth>11</bitWidth>
        </field>
        <field>
          <name>USBAEP</name>
          <bitOffset>15</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EONUM/DPID</name>
          <bitOffset>16</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>NAKSTS</name>
          <bitOffset>17</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EPTYP</name>
          <bitOffset>18</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>STALL</name>
          <bitOffset>21</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TXFNUM</name>
          <bitOffset>22</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>CNAK</name>
          <bitOffset>26</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>SNAK</name>
          <bitOffset>27</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>SD0PID/SEVNFRM</name>
          <bitOffset>28</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>SODDFRM</name>
          <bitOffset>29</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EPDIS</name>
          <bitOffset>30</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EPENA</name>
          <bitOffset>31</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>DIEPINT2</name>
        <addressOffset>0x948</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>XFRC</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EPDISD</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TOC</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ITTXFE</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>INEPNM</name>
          <bitOffset>5</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>INEPNE</name>
          <bitOffset>6</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TXFE</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>PKTDRPSTS</name>
          <bitOffset>11</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>NAK</name>
          <bitOffset>13</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>DIEPTSIZ2</name>
        <addressOffset>0x950</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>XFRSIZ</name>
          <bitOffset>0</bitOffset>
          <bitWidth>19</bitWidth>
        </field>
        <field>
          <name>PKTCNT</name>
          <bitOffset>19</bitOffset>
          <bitWidth>10</bitWidth>
        </field>
      </fields>
      <register>
        <name>DTXFSTS2</name>
        <addressOffset>0x958</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>INEPTFSAV</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>DIEPCTL3</name>
        <addressOffset>0x960</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>MPSIZ</name>
          <bitOffset>0</bitOffset>
          <bitWidth>11</bitWidth>
        </field>
        <field>
          <name>USBAEP</name>
          <bitOffset>15</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EONUM/DPID</name>
          <bitOffset>16</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>NAKSTS</name>
          <bitOffset>17</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EPTYP</name>
          <bitOffset>18</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>STALL</name>
          <bitOffset>21</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TXFNUM</name>
          <bitOffset>22</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>CNAK</name>
          <bitOffset>26</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>SNAK</name>
          <bitOffset>27</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>SD0PID/SEVNFRM</name>
          <bitOffset>28</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>SODDFRM</name>
          <bitOffset>29</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EPDIS</name>
          <bitOffset>30</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EPENA</name>
          <bitOffset>31</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>DIEPINT3</name>
        <addressOffset>0x968</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>XFRC</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EPDISD</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TOC</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ITTXFE</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>INEPNM</name>
          <bitOffset>5</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>INEPNE</name>
          <bitOffset>6</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TXFE</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>PKTDRPSTS</name>
          <bitOffset>11</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>NAK</name>
          <bitOffset>13</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>DIEPTSIZ3</name>
        <addressOffset>0x970</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>XFRSIZ</name>
          <bitOffset>0</bitOffset>
          <bitWidth>19</bitWidth>
        </field>
        <field>
          <name>PKTCNT</name>
          <bitOffset>19</bitOffset>
          <bitWidth>10</bitWidth>
        </field>
      </fields>
      <register>
        <name>DTXFSTS3</name>
        <addressOffset>0x978</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>INEPTFSAV</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>DOEPCTL0</name>
        <addressOffset>0xb00</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>MPSIZ</name>
          <bitOffset>0</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>USBAEP</name>
          <bitOffset>15</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>NAKSTS</name>
          <bitOffset>17</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EPTYP</name>
          <bitOffset>18</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>SNPM</name>
          <bitOffset>20</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>STALL</name>
          <bitOffset>21</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CNAK</name>
          <bitOffset>26</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>SNAK</name>
          <bitOffset>27</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EPDIS</name>
          <bitOffset>30</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EPENA</name>
          <bitOffset>31</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>DOEPINT0</name>
        <addressOffset>0xb08</addressOffset>
        <size>0x20</size>
      </register>
