modm-ext/archive-stmicro-svd/rm_rm0008_stm32f101c4t6.svd
      <fields>
        <field>
          <name>XFRC</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EPDISD</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>STUP</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>OTEPDIS</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>STSPHSRX</name>
          <bitOffset>5</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>OUTPKTERR</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>BERR</name>
          <bitOffset>12</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>NAK</name>
          <bitOffset>13</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>DOEPTSIZ0</name>
        <addressOffset>0xb10</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>XFRSIZ</name>
          <bitOffset>0</bitOffset>
          <bitWidth>7</bitWidth>
        </field>
        <field>
          <name>PKTCNT</name>
          <bitOffset>19</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>STUPCNT</name>
          <bitOffset>29</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
      </fields>
      <register>
        <name>DOEPCTL1</name>
        <addressOffset>0xb20</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>MPSIZ</name>
          <bitOffset>0</bitOffset>
          <bitWidth>11</bitWidth>
        </field>
        <field>
          <name>USBAEP</name>
          <bitOffset>15</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EONUM/DPID</name>
          <bitOffset>16</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>NAKSTS</name>
          <bitOffset>17</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EPTYP</name>
          <bitOffset>18</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>SNPM</name>
          <bitOffset>20</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>STALL</name>
          <bitOffset>21</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CNAK</name>
          <bitOffset>26</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>SNAK</name>
          <bitOffset>27</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>SD0PID/SEVNFRM</name>
          <bitOffset>28</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>SODDFRM</name>
          <bitOffset>29</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EPDIS</name>
          <bitOffset>30</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EPENA</name>
          <bitOffset>31</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>DOEPINT1</name>
        <addressOffset>0xb28</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>XFRC</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EPDISD</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>STUP</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>OTEPDIS</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>STSPHSRX</name>
          <bitOffset>5</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>OUTPKTERR</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>BERR</name>
          <bitOffset>12</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>NAK</name>
          <bitOffset>13</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>DOEPTSIZ1</name>
        <addressOffset>0xb30</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>XFRSIZ</name>
          <bitOffset>0</bitOffset>
          <bitWidth>19</bitWidth>
        </field>
        <field>
          <name>PKTCNT</name>
          <bitOffset>19</bitOffset>
          <bitWidth>10</bitWidth>
        </field>
        <field>
          <name>RXDPID/STUPCNT</name>
          <bitOffset>29</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
      </fields>
      <register>
        <name>DOEPCTL2</name>
        <addressOffset>0xb40</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>MPSIZ</name>
          <bitOffset>0</bitOffset>
          <bitWidth>11</bitWidth>
        </field>
        <field>
          <name>USBAEP</name>
          <bitOffset>15</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EONUM/DPID</name>
          <bitOffset>16</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>NAKSTS</name>
          <bitOffset>17</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EPTYP</name>
          <bitOffset>18</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>SNPM</name>
          <bitOffset>20</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>STALL</name>
          <bitOffset>21</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CNAK</name>
          <bitOffset>26</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>SNAK</name>
          <bitOffset>27</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>SD0PID/SEVNFRM</name>
          <bitOffset>28</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>SODDFRM</name>
          <bitOffset>29</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EPDIS</name>
          <bitOffset>30</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EPENA</name>
          <bitOffset>31</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>DOEPINT2</name>
        <addressOffset>0xb48</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>XFRC</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EPDISD</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>STUP</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>OTEPDIS</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>STSPHSRX</name>
          <bitOffset>5</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>OUTPKTERR</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>BERR</name>
          <bitOffset>12</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>NAK</name>
          <bitOffset>13</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>DOEPTSIZ2</name>
        <addressOffset>0xb50</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>XFRSIZ</name>
          <bitOffset>0</bitOffset>
          <bitWidth>19</bitWidth>
        </field>
        <field>
          <name>PKTCNT</name>
          <bitOffset>19</bitOffset>
          <bitWidth>10</bitWidth>
        </field>
        <field>
          <name>RXDPID/STUPCNT</name>
          <bitOffset>29</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
      </fields>
      <register>
        <name>DOEPCTL3</name>
        <addressOffset>0xb60</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>MPSIZ</name>
          <bitOffset>0</bitOffset>
          <bitWidth>11</bitWidth>
        </field>
        <field>
          <name>USBAEP</name>
          <bitOffset>15</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EONUM/DPID</name>
          <bitOffset>16</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>NAKSTS</name>
          <bitOffset>17</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EPTYP</name>
          <bitOffset>18</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>SNPM</name>
          <bitOffset>20</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>STALL</name>
          <bitOffset>21</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CNAK</name>
          <bitOffset>26</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>SNAK</name>
          <bitOffset>27</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>SD0PID/SEVNFRM</name>
          <bitOffset>28</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>SODDFRM</name>
          <bitOffset>29</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EPDIS</name>
          <bitOffset>30</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EPENA</name>
          <bitOffset>31</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>DOEPINT3</name>
        <addressOffset>0xb68</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>XFRC</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EPDISD</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>STUP</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>OTEPDIS</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>STSPHSRX</name>
          <bitOffset>5</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>OUTPKTERR</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>BERR</name>
          <bitOffset>12</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>NAK</name>
          <bitOffset>13</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>DOEPTSIZ3</name>
        <addressOffset>0xb70</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>XFRSIZ</name>
          <bitOffset>0</bitOffset>
          <bitWidth>19</bitWidth>
        </field>
        <field>
          <name>PKTCNT</name>
          <bitOffset>19</bitOffset>
          <bitWidth>10</bitWidth>
        </field>
        <field>
          <name>RXDPID/STUPCNT</name>
          <bitOffset>29</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
      </fields>
      <register>
        <name>PCGCCTL</name>
        <addressOffset>0xe00</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>STPPCLK</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>GATEHCLK</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>PHYSUSP</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
    </peripheral>
    <peripheral>
      <name>FSMC</name>
      <baseAddress>0xa0000000</baseAddress>
      <register>
        <name>BCR1</name>
        <addressOffset>0x0</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>MBKEN</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>MUXEN</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>MTYP</name>
          <bitOffset>2</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>MWID</name>
          <bitOffset>4</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>FACCEN</name>
          <bitOffset>6</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>BURSTEN</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>WAITPOL</name>
          <bitOffset>9</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>WRAPMOD</name>
          <bitOffset>10</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>WAITCFG</name>
          <bitOffset>11</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>WREN</name>
          <bitOffset>12</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>WAITEN</name>
          <bitOffset>13</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EXTMOD</name>
          <bitOffset>14</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ASYNCWAIT</name>
          <bitOffset>15</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CPSIZE</name>
          <bitOffset>16</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>CBURSTRW</name>
          <bitOffset>19</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>BTR1</name>
        <addressOffset>0x4</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>ADDSET</name>
          <bitOffset>0</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>ADDHLD</name>
          <bitOffset>4</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>DATAST</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>BUSTURN</name>
          <bitOffset>16</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>CLKDIV</name>
          <bitOffset>20</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>DATLAT</name>
          <bitOffset>24</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>ACCMOD</name>
          <bitOffset>28</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>s</name>
          <bitOffset>30</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
      </fields>
      <register>
        <name>BCR2</name>
        <addressOffset>0x8</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>MBKEN</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>MUXEN</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>MTYP</name>
          <bitOffset>2</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>MWID</name>
          <bitOffset>4</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>FACCEN</name>
          <bitOffset>6</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>BURSTEN</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>WAITPOL</name>
          <bitOffset>9</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>WRAPMOD</name>
          <bitOffset>10</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>WAITCFG</name>
          <bitOffset>11</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>WREN</name>
          <bitOffset>12</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>WAITEN</name>
          <bitOffset>13</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EXTMOD</name>
          <bitOffset>14</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ASYNCWAIT</name>
          <bitOffset>15</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CPSIZE</name>
          <bitOffset>16</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>CBURSTRW</name>
          <bitOffset>19</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>BTR2</name>
        <addressOffset>0xc</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>ADDSET</name>
          <bitOffset>0</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>ADDHLD</name>
          <bitOffset>4</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>DATAST</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>BUSTURN</name>
          <bitOffset>16</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>CLKDIV</name>
          <bitOffset>20</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>DATLAT</name>
          <bitOffset>24</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>ACCMOD</name>
          <bitOffset>28</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>s</name>
          <bitOffset>30</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
      </fields>
      <register>
        <name>BCR3</name>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>MBKEN</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>MUXEN</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>MTYP</name>
          <bitOffset>2</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>MWID</name>
          <bitOffset>4</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>FACCEN</name>
          <bitOffset>6</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>BURSTEN</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>WAITPOL</name>
          <bitOffset>9</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>WRAPMOD</name>
          <bitOffset>10</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>WAITCFG</name>
          <bitOffset>11</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>WREN</name>
          <bitOffset>12</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>WAITEN</name>
          <bitOffset>13</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EXTMOD</name>
          <bitOffset>14</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ASYNCWAIT</name>
          <bitOffset>15</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CPSIZE</name>
          <bitOffset>16</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>CBURSTRW</name>
          <bitOffset>19</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>BTR3</name>
        <addressOffset>0x14</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>ADDSET</name>
          <bitOffset>0</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>ADDHLD</name>
          <bitOffset>4</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>DATAST</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>BUSTURN</name>
          <bitOffset>16</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>CLKDIV</name>
          <bitOffset>20</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>DATLAT</name>
          <bitOffset>24</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>ACCMOD</name>
          <bitOffset>28</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>s</name>
          <bitOffset>30</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
      </fields>
      <register>
        <name>BCR4</name>
        <addressOffset>0x18</addressOffset>
        <size>0x20</size>
      </register>
